#### this file will convert each sql query to its equivivalent python syntax 
#### https://mode.com/blog/group-by-sql-python/

### sample employee.csv file

-------------------------------------------------------------------------
empid		empname		    city		        salary

-------------------------------------------------------------------------

1		    empname_1		New York City		97000

2		    empname_2		Boston		        

3		    empname_3		Jersey City		    83000

4		    empname_4				            71000

5		    empname_5		New York City		92500

6		    empname_6		Boston		        89500

7		    empname_7		Boston		        56500

8		    empname_8		New York City		

9		    empname_9		Boston		        91000

10		    empname_10		Jersey City		    87500


-------------------------------------------------------------------------

In [1]:
import pandas as pd

employees = pd.read_csv('.\employees.csv')

In [2]:
# note some NaN values
employees.head(15)

   empid     empname           city   salary
0      1   empname_1  New York City  97000.0
1      2   empname_2         Boston      NaN
2      3   empname_3    Jersey City  83000.0
3      4   empname_4            NaN  71000.0
4      5   empname_5  New York City  92500.0
5      6   empname_6         Boston  89500.0
6      7   empname_7         Boston  56500.0
7      8   empname_8  New York City      NaN
8      9   empname_9         Boston  91000.0
9     10  empname_10    Jersey City  87500.0

### Query1 
#### select city, count(city) city_count from employees group by city

In [3]:
# to_frame is used to convert series object back to frame
# rename is used to rename the aggregate column
# reset_index is used to avoid multi index header
# style.hide_index is used to hide row index

agg_by_city = employees.groupby(["city"])['city'].count().to_frame().rename(columns={'city' : 'city_count'}).reset_index().style.hide_index()
agg_by_city

### Query
#### select count(1) row_count, count(city) city_count, count(salary) from employees

# not a correct solution
employees.describe()

### Query3
#### select city, count(city) city_count, max(salary) max_salary, min(salary) min_salary from employees group by city

In [4]:
import numpy as np
agg_by_city_salary = (employees.groupby(["city"])) \
                        .agg({'city' :[np.size], 'salary' : [np.size, np.min, np.max]}) 
                        #.rename(columns ={'size' : 'city_size'})

# provide unique name to each column
agg_by_city_salary.columns = ['_'.join(col) for col in agg_by_city_salary.columns.values]

# flatten the multi index header
agg_by_city_salary = agg_by_city_salary.reset_index()

agg_by_city_salary.head(20).style.hide_index()

### Query 4
#### select city, count(city) city_count, max(salary) max_salary, min(salary) min_salary from employees group by city
#### having min(salary) > 60000

In [5]:
agg_by_city_salary[(agg_by_city_salary.salary_amin > 60000)]

            city  city_size  salary_size  salary_amin  salary_amax
1    Jersey City          2          2.0      83000.0      87500.0
2  New York City          3          3.0      92500.0      97000.0